# ------------------------------------------------------------------
#  HCLT-YOLO-S architecture file (4-scale detect head, SIoU loss)
#  Mirrors Table I & Fig. 1 in the paper[1].
# ------------------------------------------------------------------
nc: 43         # number of classes in GTSDB; change to your dataset
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # [from, repeats, module, args]
  [[-1, 1, Conv,      [32, 3, 2]],      # 0  P1/2
   [-1, 1, CRepvit,   [ 64, 1]],        # 1  P2/4
   [-1, 1, CRepvit,   [128, 2]],        # 2  P3/8
   [-1, 1, CRepvit,   [256, 3]],        # 3  P4/16
   [-1, 1, CRepvit,   [512, 1]],        # 4  P5/32
  ]

neck:
  [[4, 1, CRepvit,  [512, 1]],          # 5
   [-1, 1, nn.Upsample, [None, 2, nearest]],  # 6
   [[-1, 3], 1, DG_C2f, [256, 1]],      # 7
   [-1, 1, nn.Upsample, [None, 2, nearest]],  # 8
   [[-1, 2], 1, DG_C2f, [128, 1]],      # 9
   [-1, 1, nn.Upsample, [None, 2, nearest]],  # 10  (extra up-sample)
   [[-1, 1], 1, DG_C2f, [ 64, 1]],      # 11 small-object branch

   [-1, 1, Conv, [128, 3, 2]],          # 12
   [[-1, 9], 1, DG_C2f, [128, 1]],      # 13
   [-1, 1, Conv, [256, 3, 2]],          # 14
   [[-1, 7], 1, DG_C2f, [256, 1]],      # 15
   [-1, 1, Conv, [512, 3, 2]],          # 16
   [[-1, 5], 1, DG_C2f, [512, 1]],      # 17
  ]

head:
  [[11, 13, 15, 17], 1, Detect, [nc]]   # 4 detection scales
